# task_1
import random

# Генеруємо випадкове число від 0 до 59
min = random.randint(0, 59)

# Визначаємо в якій четверті години попадає число
if 0 <= min <= 14:
    quarter = "першу"
elif 15 <= min <= 29:
    quarter = "другу"
elif 30 <= min <= 44:
    quarter = "третю"
else:
    quarter = "четверту"

# Виводимо результат
print(f"Число {min} попадає в {quarter} четверть години.")


#task_2
# birth_mounts = int(input('Вветіть номер місяця вашого народження: '))
# if birth_mounts == 12 or 1 <= birth_mounts <= 2:
#     print("Зима - За вікном падав сніг.")
# elif 3 <= birth_mounts <= 5:
#     print("Весна - Все довкола розцвітало.")
# elif 6 <= birth_mounts <= 8:
#     print("Літо - Діти насолоджувались літніми канікулами.")
# elif 9 <= birth_mounts <= 11:
#     print("Осінь - Все довкола загоралось яскравими фарбами.")
# else:
#     print("Ви ввели некоректий місяць. Введіть чисто від 1 до 12")
#
# # task_2_1 - інший варіант
# birth_month = int(input("Введіть номер місяця вашого народження: "))
#
# if birth_month == 12 or birth_month <= 2:
#     print("За вікном падав сніг.")
# elif birth_month <= 5:
#     print("Все довкола розцвітало.")
# elif birth_month <= 8:
#     print("Діти насолоджувались літніми канікулами.")
# elif birth_month <= 11:
#     print("Все довкола загоралось яскравими фарбами.")
# else:
#     print("Некоректні дані!")
#
# # task_3
#
# import random
#
# # генеруємо випадкове ціле число
# x = random.randint(1, 999)
# x = str(x)
# # перевіряємо, чи виконуються умови ділення на 6
# if int(x[-1]) % 2 == 0 and sum(int(d) for d in x) % 3 == 0:
# # if x % 10 % 2 == 0 - ще можна так перевірити останнє число
#     print(f"Число", x, "ділиться на 6")
# else:
#     print(f"Число", x, "не ділиться на 6")
#
# # task_4
# x = float(input("Введіть кординату х: "))
# y = float(input("Введіть кординату y: "))
#
# if x == 0:
#     if y == 0:
#         print("Точка знаходиться в початку координат")
#     else:
#         print("Точка знаходиться на осі X")
# else:
#     if y == 0:
#         print("Точка знаходиться на осі Y")
#     else:
#         if x > 0:
#             if y > 0:
#                 print("Точка належить першій координатній чверті")
#             else:
#                 print("Точка належить четвертій координатній чверті")
#         else:
#             if y > 0:
#                 print("Точка належить другій координатній чверті")
#             else:
#                 print("Точка належить третій координатній чверті")
#
#
# # task_4 - шнший варіант
# x = float(input("Введіть координату x: "))
# y = float(input("Введіть координату y: "))
#
# if x > 0 and y > 0:
#     print("Точка належить першій координатній чверті")
# elif x < 0 and y > 0:
#     print("Точка належить другій координатній чверті")
# elif x < 0 and y < 0:
#     print("Точка належить третій координатній чверті")
# elif x > 0 and y < 0:
#     print("Точка належить четвертій координатній чверті")
# elif x == 0 and y == 0:
#     print("Точка знаходиться в початку координат")
# elif x == 0 and y != 0:
#     print("Точка знаходиться на осі Х")
# else:
#     print("Точка знаходиться на осі Y")
